{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb (Leonardo DiCaprio), a highly skilled “dream‑stealer” who extracts secrets by entering people’s subconscious minds. Cobb is offered a chance to clear his criminal record—if he can successfully implant an idea into the mind of a target (an “inception”). To pull this off, he assembles a team and ventures into layered dream worlds, confronting both the mechanics of shared dreaming and the emotional baggage from his own past. The story centers on their high‑stakes heist, the complex interplay of multiple dream levels, and the question of how much of the adventure is real versus imagined.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6988603473,false],["What company produced Inception?","It was produced by Warner Bros. in partnership with Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.6180825233,false],["When was The Dark Knight released?","The Dark Knight was released in the United States and Canada on July 18, 2008 (after opening in Australia on July 16, 2008).","The Dark Knight was released in 2008.",0.8690186739,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685992956,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.9755339622,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes—starting with the 2024 film **Deadpool & Wolverine**, the character is officially part of the Marvel Cinematic Universe (MCU). The earlier Deadpool films were not in the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6690299511,false],["What is the narrator's mental condition in Fight Club?","The narrator in *Fight Club* is portrayed as having a split‑personality condition—essentially a form of dissociative identity disorder.  He lives with a secondary persona, Tyler Durden, whom he mentally projects and ultimately discovers is a dissociated part of himself.  Along with the split personality, the character also suffers from severe insomnia and other symptoms that feed into the dissociative process.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.6736693382,false],["Who are the main actors in Pulp Fiction?","The main actors in **Pulp Fiction** are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Bruce Willis**  \n- **Tim Roth**  \n- **Ving Rhames**  \n- **Uma Thurman**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6834062338,false],["Who is Butch Coolidge?","Butch Coolidge is a fictional prizefighter who appears in Quentin Tarantino’s film *Pulp Fiction*. He is one of the three main protagonists and is central to the film’s “Gold Watch” story arc, where he wins a boxing match, accidentally kills his opponent, and must escape with Marsellus Wallace while dealing with a stolen gold watch.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.7392807007,true]]}