{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","**Inception** follows Dom Cobb, a “dream‑extractor” who specializes in stealing secrets from people’s subconscious by sharing their dreams. Cobb is offered a chance to have his criminal record wiped clean if he can successfully plant an idea in the mind of a target—a process called *inception*. To do this, he assembles a team of specialists and takes them on a complex, multi‑layered heist inside a target’s dreams, navigating different levels of subconscious reality, fighting projected protectors, and synchronizing “kicks” (wake‑up cues) to return to the real world. The film follows their attempt to complete the inception while grappling with personal guilt, the blurred line between dream and reality, and the ultimate stakes of Cobb’s return to his children.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.8319678307,true],["What company produced Inception?","Inception was produced by Warner Bros. Pictures in partnership with Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.9338845015,true],["When was The Dark Knight released?","**The Dark Knight premiered on July 14, 2008** at an IMAX event in New York City, and it was released to the general public **on July 18, 2008** in the United States and Canada (with a wider worldwide release beginning the following day).","The Dark Knight was released in 2008.",0.815025568,true],["Who kills Rachel Dawes in The Dark Knight?","I cannot answer that question.","Rachel Dawes dies in an explosion set up by the Joker.",0.0378520079,false],["What is Deadpool’s real name in the film?","Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.6409122348,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes.  \nAccording to the context, after Disney’s acquisition of 20th Century Fox, Deadpool was officially integrated into the Marvel Cinematic Universe. The 2024 sequel, *Deadpool & Wolverine*, is described as part of Phase Five of the MCU, confirming that Deadpool’s films are now part of that shared universe.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7392183542,true],["What is the narrator's mental condition in Fight Club?","The film portrays the narrator as having a dissociative condition—essentially a split‑personality or dissociative identity disorder, as he eventually realizes he is actually projecting another persona (Tyler Durden) within himself.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8809971809,true],["Who are the main actors in Pulp Fiction?","The main actors credited in **Pulp Fiction** are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Bruce Willis**  \n- **Tim Roth**  \n- **Ving Rhames**  \n- **Uma Thurman**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.7080347538,true],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who has double‑crossed crime boss Marsellus Wallace and is on the run from him. The character was played by Bruce Willis and was originally written for Matt Dillon. Butch is portrayed as a tough, seasoned fighter whose look was modeled on Aldo Ray and whose demeanor was inspired by Ralph Meeker’s Mike Hammer in *Kiss Me Deadly*.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8146785498,true]]}