{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb, a skilled “dream‑extractor” who steals information by infiltrating people’s subconscious.  Inception’s central premise is a heist‑style mission: Cobb and his team are hired to perform the reverse operation—**to implant a new idea into a target’s mind** (the “inception”).  To do this they must layer multiple dreams, each level becoming increasingly fragile, while dealing with the emotional baggage Cobb carries from the death of his wife. The story tracks their elaborate plan, the risks of losing themselves in the dream layers, and Cobb’s struggle to distinguish reality from dream as he tries to return home.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.8105034828,true],["What company produced Inception?","I cannot answer that question.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.1196869016,false],["When was The Dark Knight released?","The film premiered internationally in mid‑July 2008 – opening in Australia and Taiwan on **Wednesday, July 16 2008**, and then in the United States on **Friday, July 18 2008**.","The Dark Knight was released in 2008.",0.5278338194,false],["Who kills Rachel Dawes in The Dark Knight?","The Joker is responsible for Rachel Dawes’ death—he sets up the explosions that ultimately kill her.","Rachel Dawes dies in an explosion set up by the Joker.",0.9127517343,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.9694763422,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After the 21st Century Fox acquisition, Marvel Studios brought Deadpool into the Marvel Cinematic Universe. The character’s first MCU appearance was in **Deadpool & Wolverine** (released July 26, 2024 as part of Phase Five). Prior to that, the 2016‑2018 Deadpool films were released outside the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.691442132,false],["What is the narrator's mental condition in Fight Club?","The narrator suffers from dissociative identity disorder—a split‑personality condition that makes him an unreliable narrator.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.7979689837,true],["Who are the main actors in Pulp Fiction?","The film’s core cast features:\n\n- **John Travolta** as Vincent Vega  \n- **Samuel L. Jackson** as Jules Winnfield  \n- **Uma Thurman** as Mia Wallace  \n- **Bruce Willis** as Butch Coolidge  \n- **Ving Rhames** as Marsellus Wallace  \n- **Tim Roth** as Ringo\/Pumpkin  \n- **Harvey Keitel** as Winston Wolfe  \n\nThese actors carry the main, interlocking storylines in *Pulp Fiction*.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.571176827,false],["Who is Butch Coolidge?","Butch Coolidge is the aging boxer who appears in Quentin Tarantino’s *Pulp Fiction*.  Played by Bruce Willis, he is on the run from Marsellus Wallace after double‑crossing him in a fight.  Butch wins the bout but accidentally kills his opponent, plans to flee with his girlfriend Fabienne, and is forced to retrieve his father’s gold watch.  He is shot by Vincent Vega, later rams into Marsellus at a traffic light, and is involved in a violent confrontation at a pawnshop.  The character was written to evoke the swagger of 1950s hard‑boiled heroes and is a key part of the film’s interlocking storylines.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8230944872,true]]}