{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb, a professional “extractor” who steals information by infiltrating people’s dreams. A wealthy businessman, Saito, hires him to perform the reverse operation—“inception”—by planting an idea in the mind of Robert Fischer, the heir to a rival empire, so that Fischer will dissolve his father’s company. Cobb assembles a team (Arthur, a forger Eames, a chemist Yusuf, and an architecture student Ariadne) and stages a multi‑layered dream heist inside Fischer’s subconscious. Along the way, Cobb must confront his own subconscious projections, especially the haunting image of his deceased wife Mal, and navigate the risks of falling into the dream‑world “limbo.” The ultimate goal is to implant the idea successfully and have Cobb’s criminal record wiped clean.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7500652075,true],["What company produced Inception?","Inception was produced by Warner Bros. (in collaboration with Legendary Pictures).","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.961412549,true],["When was The Dark Knight released?","The film premiered in the United States on **July 18, 2008** (and had its initial releases in Australia and Taiwan on July 16, 2008).","The Dark Knight was released in 2008.",0.5639638901,false],["Who kills Rachel Dawes in The Dark Knight?","The death of Rachel Dawes is caused by the explosion that the Joker orchestrates – in effect, the Joker is responsible for her killing.","Rachel Dawes dies in an explosion set up by the Joker.",0.883403182,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.9755339622,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 20th Century Fox, the Deadpool franchise was brought into the Marvel Cinematic Universe.  The 2024 film **Deadpool & Wolverine** was released as part of Phase Five of the MCU, making Deadpool a member of the MCU’s broader continuity.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7032065392,true],["What is the narrator's mental condition in Fight Club?","The narrator suffers from dissociative identity disorder, manifesting as a split personality—he mentally projects Tyler Durden as an alter‑ego.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.9352858067,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- **John Travolta**\n- **Samuel L. Jackson**\n- **Bruce Willis**\n- **Uma Thurman**\n- **Tim Roth**\n- **Ving Rhames**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6825656295,false],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who is on the run from crime boss Marsellus Wallace after double‑crossing him. He is portrayed by Bruce Willis in *Pulp Fiction*.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8630345464,true]]}