{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Cobb, a professional thief who steals secrets by entering people’s subconscious dream worlds. He is offered a chance to erase his criminal past in exchange for planting an idea into a target’s mind (the “inception” mission). To do this, he assembles a team and stages a complex, multi‑level dream heist, navigating several nested dream realities while grappling with the emotional fallout of his own past. The plot centers on this high‑stakes manipulation of shared dreams and the blurred line between reality and the subconscious.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7516394854,true],["What company produced Inception?","Inception was produced by Warner Bros. Pictures in partnership with Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.9338845015,true],["When was The Dark Knight released?","The Dark Knight was widely released in the United States and Canada on **July 18, 2008**.","The Dark Knight was released in 2008.",0.8936327696,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685992956,true],["What is Deadpool’s real name in the film?","The character’s real name in the film is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.8109909892,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 21st Century Fox, the Deadpool character’s film rights were returned to Marvel Studios, and the franchise has since been integrated into the Marvel Cinematic Universe, with the third film “Deadpool & Wolverine” released as part of Phase Five.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7007027864,true],["What is the narrator's mental condition in Fight Club?","The narrator is depicted as suffering from a dissociative identity disorder—a split personality in which Tyler Durden is an alter‑ego.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.9504199624,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- **John Travolta** as Vincent Vega  \n- **Samuel L. Jackson** as Jules Winnfield  \n- **Bruce Willis** as Butch Coolidge  \n- **Uma Thurman** as Mia Wallace  \n- **Tim Roth** as Marsellus Wallace  \n- **Ving Rhames** as Lance\n\nThese six actors carry the film’s primary roles.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5870096684,false],["Who is Butch Coolidge?","Butch Coolidge is the film’s aging prize‑fighter who serves as one of the three main protagonists in *Pulp Fiction*.  He is a boxer who double‑crosses Marsellus Wallace by winning a match, accidentally kills his opponent, and then attempts to flee Los Angeles with his girlfriend Fabienne while retrieving a gold watch that belonged to his father.  The character is portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8004312515,true]]}