{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Cobb, a professional thief who steals information by entering people’s subconscious. He is offered a final chance to clear his record if he can plant an idea into the mind of a wealthy target. To do this he assembles a team (Ariadne, Eames, Yusuf, Arthur, and Saito) and stages a complex heist inside multiple layers of dream worlds. They infiltrate an alpine fortress, synchronize “kicks” (the mechanisms that bring them back to reality), and must avoid being trapped in limbo. Throughout the operation Cobb also confronts the guilt and grief over his dead wife, which ultimately influences the success of the inception.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6698129177,false],["What company produced Inception?","The film was produced by **Warner Bros. and Legendary Pictures**.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.5832221508,false],["When was The Dark Knight released?","The Dark Knight was first released on **July 18, 2008** in the United States and Canada (it opened earlier, on July 16, 2008, in Australia and Taiwan).","The Dark Knight was released in 2008.",0.8342804909,true],["Who kills Rachel Dawes in The Dark Knight?","I cannot answer that question.","Rachel Dawes dies in an explosion set up by the Joker.",0.0378520079,false],["What is Deadpool’s real name in the film?","Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.6409122348,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes.  Deadpool is now part of the Marvel Cinematic Universe; the character’s third film, *Deadpool & Wolverine*, was released as part of Phase Five of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.629789114,false],["What is the narrator's mental condition in Fight Club?","The narrator displays symptoms of **dissociative identity disorder (split personality)**, presenting a dual identity as himself and as Tyler Durden. In addition to the split personality, he struggles with chronic insomnia and pervasive dissatisfaction with his job and lifestyle.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8719906211,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Bruce Willis**  \n- **Uma Thurman**  \n- **Tim Roth**  \n- **Ving Rhames**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6825656295,false],["Who is Butch Coolidge?","Butch Coolidge is the aging professional boxer who appears in Quentin Tarantino’s *Pulp Fiction*.  Played by Bruce Willis, he double‑crosses hit‑man Marsellus Wallace by refusing to throw a fight he had been paid to lose.  After winning the bout he tries to flee with his girlfriend Fabienne, but the plan goes awry when he discovers a gold watch left behind by his father.  He is pursued by Marsellus and his enforcers, leading to a tense showdown in which Butch ultimately escapes, leaving behind a memorable legacy of grit, loyalty and a bit of classic noir swagger.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8268501759,true]]}